src/cf/InformationRegisters/СтатусыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтатусыДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументовВыплатыСамозанятым</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыПлатежногоПоручения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительныйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПоступленияПоСчету</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыОтгрузки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусСчетаФактуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСчетаФактуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыплатыСамозанятым</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеДСПлан</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходДСПлан</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СтатусыСчетаФактуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыСчетаФактуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Проведен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПроведен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отсутствует</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СтатусыДокументовВыплатыСамозанятым.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыДокументовВыплатыСамозанятым</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выгружено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноОплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧекиЗагружены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧекиЧастичноЗагружены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СтатусыПлатежногоПоручения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыПлатежногоПоручения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСоздано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеТребуется</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/СтатусыДокументов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Устанавливает статус документа
//
// Параметры:
//  Документ             - ДокументСсылка.* - документ для которого требуется установить статус
//  Статус               - ПеречислениеСсылка.* - новый статус документа
//
Процедура УстановитьСтатусДокумента(Документ, Статус = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Документ) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийСтатус = ПолучитьСтатусДокумента(Документ);
	
	Если ЗначениеЗаполнено(Статус) Тогда
		НовыйСтатус = Статус;
	Иначе
		НовыйСтатус = ОпределитьСтатусДокумента(Документ);
	КонецЕсли;
	
	Если ТекущийСтатус <> НовыйСтатус Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		НаборЗаписей = РегистрыСведений.СтатусыДокументов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(Документ);
		
		Запись = НаборЗаписей.Добавить();
		Запись.Документ = Документ;
		Запись.Статус 	= НовыйСтатус;
		
		НаборЗаписей.Записать();
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает статус документа
//
// Параметры:
//  Документ             - ДокументСсылка.* - документ
//  СтатусыДокумента     - Структура - см. НовыеСтатусыДокумента()
//
// Возвращаемое значение:
//  Булево - Истина, если статус документа изменен
//
Функция УстановитьСтатусыДокумента(Документ, СтатусыДокумента) Экспорт
	
	Если ЗначениеЗаполнено(Документ) Тогда
		МассивДокументов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Документ);
		СтатусИзменен = УстановитьСтатусыДокументов(МассивДокументов, СтатусыДокумента);
	Иначе
		СтатусИзменен = Ложь;
	КонецЕсли;
	
	Возврат СтатусИзменен;
	
КонецФункции

// Устанавливает статус нескольких документов.
// Статус может быть изменен только у тех документов, на редактирование которых у пользователя есть права.
//
// Параметры:
//  МассивДокументов     - Массив - содержит ссылки на документы (должны быть одного вида!)
//  СтатусыДокумента     - Структура - см. НовыеСтатусыДокумента()
//
// Возвращаемое значение:
//  Булево - Истина, если статус хотя бы одного документа изменен
//
Функция УстановитьСтатусыДокументов(МассивДокументов, СтатусыДокумента) Экспорт
	
	СтатусИзменен = Ложь;
	
	Если МассивДокументов.Количество() = 0 Тогда
		Возврат СтатусИзменен;
	КонецЕсли;
	
	ИзменитьСтатус = (СтатусыДокумента.Статус <> Неопределено);
	ИзменитьДополнительныйСтатус = (СтатусыДокумента.ДополнительныйСтатус <> Неопределено);
	ИзменитьСтатусСчетаФактуры   = (СтатусыДокумента.СтатусСФ <> Неопределено);
	ИзменитьСтатусОригиналаСФ = (СтатусыДокумента.СтатусОригиналаСФ <> Неопределено);
	ИзменитьНомерСчетаФактуры = (СтатусыДокумента.НомерСчетаФактуры <> "");
	
	Если Не ИзменитьСтатус 
		И Не ИзменитьДополнительныйСтатус 
		И Не ИзменитьСтатусСчетаФактуры
		И Не ИзменитьСтатусОригиналаСФ 
		И Не ИзменитьНомерСчетаФактуры Тогда
		Возврат СтатусИзменен;
	КонецЕсли;
	
	СтатусыПоУмолчанию = СтатусНовогоДокумента(МассивДокументов[0]);
	
	// Убедимся, что документ поддерживает установку статусов (должен быть определен статус по умолчанию).
	Если СтатусыПоУмолчанию.Статус = Неопределено Тогда
		Возврат СтатусИзменен;
	КонецЕсли;
	
	МетаданныеДокумента = МассивДокументов[0].Метаданные();
	ВыполнитьПроверкуПравДоступа("Изменение", МетаданныеДокумента);
	
	ИмяДокумента = МетаданныеДокумента.Имя;
	
	ВремяНачалаОперации = ОценкаПроизводительности.НачатьЗамерВремени();
	
	НачатьТранзакцию();

	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.СтатусыДокументов");
		Для Каждого ДокументМассива Из МассивДокументов Цикл
			ЭлементБлокировкиДанных.УстановитьЗначение("Документ", ДокументМассива);
		КонецЦикла;	
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Разделяемый;
		БлокировкаДанных.Заблокировать();
 
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
		Запрос.УстановитьПараметр("СтатусОплатыПоУмолчанию", СтатусыПоУмолчанию.Статус);
		Запрос.УстановитьПараметр("ДополнительныйСтатусПоУмолчанию", СтатусыПоУмолчанию.ДополнительныйСтатус);
		Запрос.УстановитьПараметр("СтатусСчетаФактурыПоУмолчанию", Перечисления.СтатусыСчетаФактуры.ПустаяСсылка());
		Запрос.УстановитьПараметр("СтатусОригиналаСФПоУмолчанию", СтатусыПоУмолчанию.Статус);
		Запрос.УстановитьПараметр("НомерСчетаФактурыПоУмолчанию", "");
		
		ТекстЗапроса = // Имя таблицы с документами может быть заменено ниже
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаДокументов.Организация КАК Организация,
		|	ТаблицаДокументов.Ссылка КАК Документ,
		|	ЕСТЬNULL(СтатусыДокументов.Статус, &СтатусОплатыПоУмолчанию) КАК Статус,
		|	ЕСТЬNULL(СтатусыДокументов.ДополнительныйСтатус, &ДополнительныйСтатусПоУмолчанию) КАК ДополнительныйСтатус,
		|	ЕСТЬNULL(СтатусыДокументов.СтатусСчетаФактуры, &СтатусСчетаФактурыПоУмолчанию) КАК СтатусСчетаФактуры,
		|	ЕСТЬNULL(СтатусыДокументов.НомерСчетаФактуры, &НомерСчетаФактурыПоУмолчанию) КАК НомерСчетаФактуры
		|ИЗ
		|	Документ.СчетНаОплату КАК ТаблицаДокументов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
		|		ПО ТаблицаДокументов.Ссылка = СтатусыДокументов.Документ
		|ГДЕ
		|	ТаблицаДокументов.Ссылка В(&МассивДокументов)";
		
		Запрос.Текст = СтрЗаменить(ТекстЗапроса, "СчетНаОплату", ИмяДокумента);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если (Не ИзменитьСтатус Или Выборка.Статус = СтатусыДокумента.Статус)
				И (Не ИзменитьДополнительныйСтатус Или Выборка.ДополнительныйСтатус = СтатусыДокумента.ДополнительныйСтатус)
				И (Не ИзменитьСтатусСчетаФактуры Или Выборка.СтатусСчетаФактуры = СтатусыДокумента.СтатусСФ) 
				И (Не ИзменитьНомерСчетаФактуры Или Выборка.НомерСчетаФактуры = СтатусыДокумента.НомерСчетаФактуры) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТипЗнч(Выборка.Документ) = Тип("ДокументСсылка.ВыплатыСамозанятым") 
				И Выборка.Статус = Перечисления.СтатусыДокументовВыплатыСамозанятым.Отклонено Тогда
				// Если документ ВыплатыСамозанятым Отклонен, то другие статусы ему уже нельзя присваивать
				Продолжить;
			КонецЕсли;
			
			УстановитьПривилегированныйРежим(Истина);
			
			// При записи набора, удаляем статусы, относящиеся к другой организации
			НаборЗаписей = РегистрыСведений.СтатусыДокументов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Документ.Установить(Выборка.Документ);
			
			Запись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Если ИзменитьСтатус Тогда
				Запись.Статус = СтатусыДокумента.Статус;
			КонецЕсли;
			Если ИзменитьДополнительныйСтатус Тогда
				Запись.ДополнительныйСтатус = СтатусыДокумента.ДополнительныйСтатус;
			КонецЕсли;
			Если ИзменитьСтатусСчетаФактуры Тогда
				Запись.СтатусСчетаФактуры = СтатусыДокумента.СтатусСФ;
			КонецЕсли;
			
			Если ИзменитьНомерСчетаФактуры Тогда
				Запись.НомерСчетаФактуры = СтатусыДокумента.НомерСчетаФактуры;
			КонецЕсли; 
			
			НаборЗаписей.Записать();
			
			УстановитьПривилегированныйРежим(Ложь);
			
			СтатусИзменен = Истина;
			
		КонецЦикла;
	
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации("РегистрСведений.СтатусыДокументов",
			УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;

	ОценкаПроизводительности.ЗакончитьЗамерВремени(
		"УстановкаСтатуса",
		ВремяНачалаОперации,
		МассивДокументов.Количество(),
		Строка(ТипЗнч(МассивДокументов[0])));
	
	Возврат СтатусИзменен;
	
КонецФункции

// Возвращает текущий статус документа
//
// Параметры:
//  Организация - СправочникСсылка.Организации - организация
//  Документ    - ДокументСсылка.* - документ
//
// Возвращаемое значение:
//  Структура - структура статусов документа со свойствами:
//    * Статус - ПеречислениеСсылка - основной статус документа
//    * ДополнительныйСтатус - ПеречислениеСсылка - дополнительный статус документа
//
Функция ПолучитьСтатусыДокумента(Документ, Организация) Экспорт
	
	Если ЗначениеЗаполнено(Документ) Тогда
		КоллекцияСтатусов = ПолучитьСтатусыДокументов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Документ), Организация);
		СтатусыДокумента = КоллекцияСтатусов[Документ];
	КонецЕсли;
	
	Если СтатусыДокумента = Неопределено Тогда
		СтатусыДокумента = СтатусНовогоДокумента(Документ);
	КонецЕсли;
	
	Возврат СтатусыДокумента;
	
КонецФункции

// Возвращает текущий статус документа
//
// Параметры:
//  Документ    - ДокументСсылка.* - документ
//
// Возвращаемое значение:
//   Статус - ПеречислениеСсылка - основной статус документа
//
Функция ПолучитьСтатусДокумента(Документ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СтатусыДокументов.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
		|ГДЕ
		|	СтатусыДокументов.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	ВыборкаСтатуса = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаСтатуса.Следующий() Тогда
		Возврат ВыборкаСтатуса.Статус;
	Иначе
		Возврат Перечисления.СтатусыПлатежногоПоручения.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

// Возвращает текущие статусы документов
//
// Параметры:
//  МассивДокументов - Массив - массив ссылок на документы
//  Организация- СправочникСсылка.Организации - организация
//
// Возвращаемое значение:
//  Соответствие:
//    Ключ - ссылка на документ
//    Значение - Структура статусов документа со свойствами:
//      * Статус - ПеречислениеСсылка - основной статус документа
//      * ДополнительныйСтатус - ПеречислениеСсылка - дополнительный статус документа
//
Функция ПолучитьСтатусыДокументов(МассивДокументов, Организация = Неопределено) Экспорт
	
	КоллекцияСтатусов = Новый Соответствие;
	Для Каждого Документ Из МассивДокументов Цикл
		КоллекцияСтатусов.Вставить(Документ, СтатусНовогоДокумента(Документ));
	КонецЦикла;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СтатусыДокументов.Документ,
	|	СтатусыДокументов.Статус,
	|	СтатусыДокументов.ДополнительныйСтатус
	|ИЗ
	|	РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
	|ГДЕ
	|	&УсловиеПоОрганизации
	|	И СтатусыДокументов.Документ В(&МассивДокументов)";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	Если Организация <> Неопределено Тогда
		Запрос.УстановитьПараметр("Организация", Организация);
		УсловиеПоОрганизации = "СтатусыДокументов.Организация = &Организация";
	Иначе
		УсловиеПоОрганизации = "ИСТИНА";
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&УсловиеПоОрганизации", УсловиеПоОрганизации);
	
	// Данные о статусах не считаем секретными и для производительности читаем их привилегированно,
	// так как они читаются при открытии формы.
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(КоллекцияСтатусов[Выборка.Документ], Выборка);
	КонецЦикла;
	
	Возврат КоллекцияСтатусов;
	
КонецФункции

// Возвращает статус документа, который необходимо установить
//
// Параметры:
//  Документ             - ДокументСсылка.* - документ для которого требуется определить статус
//
// Возвращаемое значение:
//   Статус - ПеречислениеСсылка - основной статус документа
//
Функция ОпределитьСтатусДокумента(Документ) Экспорт
	
	// РасходДСПлан, ПеремещениеДСПлан
	Если НЕ ЗначениеЗаполнено(Документ.ТипДенежныхСредств) ИЛИ Документ.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные Тогда
		СтатусДокумента = Перечисления.СтатусыПлатежногоПоручения.НеТребуется;
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ИСТИНА КАК НаличиеПлатежногоПоручения
			|ИЗ
			|	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
			|ГДЕ
			|	ПлатежноеПоручение.ДокументОснование = &Документ
			|	И НЕ ПлатежноеПоручение.ПометкаУдаления
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	ИСТИНА
			|ИЗ
			|	Документ.ПлатежноеПоручение.РасшифровкаПлатежа КАК ПлатежноеПоручениеРасшифровкаПлатежа
			|ГДЕ
			|	ПлатежноеПоручениеРасшифровкаПлатежа.ДокументПланирования = &Документ
			|	И НЕ ПлатежноеПоручениеРасшифровкаПлатежа.Ссылка.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("Документ", Документ);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			СтатусДокумента = Перечисления.СтатусыПлатежногоПоручения.НеСоздано;
		Иначе
			СтатусДокумента = Перечисления.СтатусыПлатежногоПоручения.Создано;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтатусДокумента;
	
КонецФункции

// Функция-конструктор структуры статусов документа.
//
// Возвращаемое значение:
//  Структура - структура статусов документа
//
Функция НовыеСтатусыДокумента() Экспорт
	
	СтатусыДокумента = Новый Структура;
	СтатусыДокумента.Вставить("Статус", Неопределено); // основной статус документа
	СтатусыДокумента.Вставить("ДополнительныйСтатус", Неопределено);
	СтатусыДокумента.Вставить("СтатусСФ", Неопределено); // статус наличия/проведения счета-фактуры к документу
	СтатусыДокумента.Вставить("СтатусОригиналаСФ", Неопределено);
	СтатусыДокумента.Вставить("НомерСчетаФактуры", "");
	
	Возврат СтатусыДокумента;
	
КонецФункции

// Устанавливает статус счета-фактуры
//
// Параметры:
//  Документ             - ДокументСсылка.* - документ для которого требуется установить статус привязанного счета-фактуры
//  НомерСчетаФактуры    - Строка - представление номера счета-фактуры
//  СтатусСчетаФактуры   - ПеречислениеСсылка.СтатусыСчетаФактуры - новый статус счета-фактуры
//
Процедура УстановитьСтатусСчетаФактурыДокумента(Документ, НомерСчетаФактуры, СтатусСчетаФактуры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Документ)
		ИЛИ НЕ ЗначениеЗаполнено(СтатусСчетаФактуры) Тогда
		Возврат;
	КонецЕсли;
	
	СостояниеСчетаФактуры = ПолучитьСостояниеСчетаФактуры(Документ);
	
	Если СостояниеСчетаФактуры.СтатусСчетаФактуры <> СтатусСчетаФактуры
		ИЛИ СостояниеСчетаФактуры.НомерСчетаФактуры <> НомерСчетаФактуры Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		НаборЗаписей = РегистрыСведений.СтатусыДокументов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(Документ);
		
		Запись = НаборЗаписей.Добавить();
		Запись.Документ = Документ;
		Запись.НомерСчетаФактуры = НомерСчетаФактуры;
		Запись.СтатусСчетаФактуры = СтатусСчетаФактуры;
		
		НаборЗаписей.Записать();
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает текущий статус счета-фактуры документа
//
// Параметры:
//  Документ    - ДокументСсылка.* - документ
//
// Возвращаемое значение:
//   СостояниеСчетаФактуры - Структура - статус счета-фактуры и его номер
//
Функция ПолучитьСостояниеСчетаФактуры(Документ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СтатусыДокументов.СтатусСчетаФактуры КАК СтатусСчетаФактуры,
		|	СтатусыДокументов.НомерСчетаФактуры КАК НомерСчетаФактуры
		|ИЗ
		|	РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
		|ГДЕ
		|	СтатусыДокументов.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	ВыборкаСтатуса = Запрос.Выполнить().Выбрать();
	
	СостояниеСчетаФактуры = Новый Структура;
	СостояниеСчетаФактуры.Вставить("СтатусСчетаФактуры", Перечисления.СтатусыСчетаФактуры.ПустаяСсылка());
	СостояниеСчетаФактуры.Вставить("НомерСчетаФактуры", "");
	
	Если ВыборкаСтатуса.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СостояниеСчетаФактуры, ВыборкаСтатуса);
	КонецЕсли;
	
	Возврат СостояниеСчетаФактуры;
	
КонецФункции

// Обработка обновления ИБ. Заполняет статусы счетов-фактур по документам "ПередачаТоваровМеждуОрганизациями".
//
// Параметры:
//  Параметры    - Структура - параметры обработчика обновления
//
Процедура ЗаполнитьСтатусыСчетовФактурПоДокументамПередачиМеждуОрганизациями(Параметры) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ПередачаТоваровМеждуОрганизациями.Ссылка КАК Документ,
		|	ВЫБОР
		|		КОГДА СчетФактураДокументыОснования.Ссылка.Проведен
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыСчетаФактуры.Проведен)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыСчетаФактуры.НеПроведен)
		|	КОНЕЦ КАК СтатусСчетаФактуры,
		|	СчетФактураДокументыОснования.Ссылка.НомерНаПечать КАК НомерСчетаФактуры,
		|	СчетФактураДокументыОснования.Ссылка.Номер КАК Номер
		|ИЗ
		|	Документ.ПередачаТоваровМеждуОрганизациями КАК ПередачаТоваровМеждуОрганизациями
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактура.ДокументыОснования КАК СчетФактураДокументыОснования
		|		ПО ПередачаТоваровМеждуОрганизациями.Ссылка = СчетФактураДокументыОснования.ДокументОснование
		|			И (НЕ СчетФактураДокументыОснования.Ссылка.ПометкаУдаления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
		|		ПО ПередачаТоваровМеждуОрганизациями.Ссылка = СтатусыДокументов.Документ
		|ГДЕ
		|	НЕ ПередачаТоваровМеждуОрганизациями.ПометкаУдаления
		|	И НЕ СчетФактураДокументыОснования.Ссылка ЕСТЬ NULL
		|	И СтатусыДокументов.Документ ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПередачаТоваровМеждуОрганизациями.Дата УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = Ложь;
	
	НаборЗаписей = РегистрыСведений.СтатусыДокументов.СоздатьНаборЗаписей();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		
		Если НЕ ЗначениеЗаполнено(НоваяЗапись.НомерСчетаФактуры) Тогда
			НоваяЗапись.НомерСчетаФактуры = РаботаСФормойДокументаКлиентСервер.ПолучитьКороткийНомерДокумента(Выборка.Номер);
		КонецЕсли;
		
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Документ);
		
		Попытка
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей, Истина);
			НаборЗаписей.Очистить();
		Исключение
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось заполнить статус счета-фактуры для документа %1 по причине:
				|%2'", ОбщегоНазначения.КодОсновногоЯзыка()),
				Выборка.Документ,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
				УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.Документы.ПередачаТоваровМеждуОрганизациями,
				Выборка.Документ,
				ТекстСообщения);
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает статус документа по умолчанию
//
// Параметры:
//   Документ - ДокументСсылка - ссылка на документ
//
// Возвращаемое значение:
//  Структура - структура статусов документа со свойствами:
//    * Статус - ПеречислениеСсылка - основной статус документа
//    * ДополнительныйСтатус - ПеречислениеСсылка - дополнительный статус документа
//
Функция СтатусНовогоДокумента(Документ)
	
	Результат = Новый Структура("Статус, ДополнительныйСтатус");
	
	ТипДокумента = ТипЗнч(Документ);
	
	Если ТипДокумента = Тип("ДокументСсылка.ВыплатыСамозанятым") Тогда
		
		Результат.Статус = Перечисления.СтатусыДокументовВыплатыСамозанятым.СтатусНовогоДокумента();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
